[
  {
    "Picture": "https://media.entertainmentearth.com/assets/images/98871c88b6b24c579354e238473642fdmd.jpg",
    "Name": " Star Wars The Black Series Darth Malgus 6-Inch Action Figure",
    "Price": 19.99,
    "Rating": 4.5,
    "Category": "star_wars",
    "description": "A legendary Sith Lord, Darth Malgus emerges from hiding with a mysterious plan that could secure his legacy in the annals of the Sith. Based on the game The Old Republic, this powerful Dark Side user includes a lightsaber and has a cape with hood, and a removable mask. He's got it all. But will he destroy the galaxy? Ages 4 and up."
  },
  {
    "Picture": "https://media.entertainmentearth.com/assets/images/5baaf869ca2640f799e0227e435d2f66md.jpg",
    "Name": " Star Wars The Black Series Bastilla Shan 6-Inch Action Figure",
    "Price": 24.99,
    "Rating": 3.8,
    "Category": "star_wars",
    "description": "From Knights of the Old Republic! But we didn't need to tell you that - you've been wanting a Star Wars The Black Series Bastilla Shan 6-Inch Action Figure of your very own, and here she is! Bastila Shan is a brash Jedi Knight during the Jedi Civil War that took place in Old Republic era. Bastila’s affinity with the Force presents a serious threat to the Darth Malak and his Sith fleet. Ages 4 and up. Includes lightsaber."
  },
  {
    "Picture": "https://www.hamleys.com/media/catalog/product/8/7/871343...jpg?width=265&height=265&canvas=265:265&quality=80&bg-color=255,255,255&fit=bounds",
    "Name": "Thor Stormbreaker Role Play",
    "Price": 39.99,
    "Rating": 4.2,
    "Category": "marvel1",
    "description": "Please note: This is an assortment pack. One will be supplied and picked at random. Colours and decorations may vary.Imagine leaping into adventure with Avengers figures, vehicles and roleplay items inspired by the Marvel Universe. With this classic-inspired toy, children can imagine all the action of the Marvel Universe with their favourite heroes including Captain America, Black Panther and Iron Man, all featured on Disney+. Products each sold separately. Subject to availability. Children can imagine heroic characters charging into battle with these figures from the Titan Hero Series! Copyright 2020 MARVEL. Hasbro and all related terms are trademarks of Hasbro."
  },
  {
    "Picture": "https://www.hamleys.com/media/catalog/product/f/2/f22475l00_5010993797806_main_20_large_300dpi.jpg?width=265&height=265&canvas=265:265&quality=80&bg-color=255,255,255&fit=bounds",
    "Name": " Avengers Ironman Hero Figure Assortment",
    "Price": 14.99,
    "Rating": 4.0,
    "Category": "marvel",
    "description": "Please note: This is an assortment pack. One will be supplied and picked at random. Colours and decorations may vary.Imagine leaping into adventure with Avengers figures, vehicles and roleplay items inspired by the Marvel Universe. With this classic-inspired toy, children can imagine all the action of the Marvel Universe with their favourite heroes including Captain America, Black Panther and Iron Man, all featured on Disney+. Products each sold separately. Subject to availability. Children can imagine heroic characters charging into battle with these figures from the Titan Hero Series! Copyright 2020 MARVEL. Hasbro and all related terms are trademarks of Hasbro."
  },
  {
    "Picture": "https://media.entertainmentearth.com/assets/images/1e251207a91849e4ba7e8153a0a51a9cmd.jpg",
    "Name": "Transformers Generations Legacy Commander Motormaster",
    "Price": 49.99,
    "Rating": 4.8,
    "Category": "Transformers",
    "description": "He forms the core of the mighty 13-inch Stunticons combiner Menasor! Harness the power of Energon with the Transformers Legacy Series Commander Decepticon Motormaster robot toy! Motormaster wants to be known as King of the Road and will run down anyone sharing his highway. Decepticon Motormaster can combine with Deluxe Stunticon figures across the line to form Menasor! (Each sold separately, subject to availability.) Action figure converts from truck to robot in 23 steps. Trailer converts into a battle station in 23 steps. Comes with Energon sword and Energon blaster accessories. Ages 8 and up."
  },
  {
    "Picture": "https://media.entertainmentearth.com/assets/images/960251a642c34f56a676bfcde8fa21c6md.jpg",
    "Name": "Transformers Generations Legacy Deluxe Wild Rider",
    "Price": 9.99,
    "Rating": 3.5,
    "Category": "Transformers",
    "description": "Action figure converts from robot to sports car mode in 17 steps. Comes with 2 Energon blaster accessories! Collect other Transformers: Legacy combiner figures to form Menasor! (Each sold separately, subject to availability.) Decepticon Wild Rider toy combines as the Menasor figure's left leg. 5 1/2-inch robot for ages 8 and up."
  }
]
